{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_1", "data_format": "channels_last", "filters": 32, "padding": "valid", "kernel_size": [3, 3], "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "batch_input_shape": [null, 128, 128, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 32, "padding": "valid", "name": "conv2d_2", "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 11, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "bias_regularizer": null}}]}