{"config": [{"config": {"filters": 64, "use_bias": true, "name": "conv2d_1", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 128, 128, 1], "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "use_bias": true, "name": "conv2d_2", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "use_bias": true, "name": "conv2d_3", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "name": "dense_1", "units": 2048, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_2", "units": 128, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_3", "units": 29, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}